# Conductor Size Methods

Source: https://www.revitapidocs.com/2026/ee608a76-4c4a-3fc5-c4fe-4811ca7f3221.htm

---

| Conductor Size Methods |
| --- |

The ConductorSize type exposes the following members.

Methods

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a Conductor Size. |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object. (Inherited from Object ) |
|  | GetConductorSize | Gets the Conductor Size data by given Conductor Size id. |
|  | GetConductorSizeIdByName | Gets the Conductor Size id by given Conductor Size name. |
|  | GetConductorSizeIds | Gets all the Conductor Size ids in the given document, sorted by name. |
|  | GetHashCode | Serves as the default hash function. (Inherited from Object ) |
|  | GetType | Gets the Type of the current instance. (Inherited from Object ) |
|  | ToString | Returns a string that represents the current object. (Inherited from Object ) |

Top See Also

#### Reference

ConductorSize Class Autodesk.Revit.DB.Electrical Namespace